<ol>
    <li>Створити змінну <code>$page</code> та отримати значення з глобальної змінної <code>$_SERVER['REQUEST_URI']</code> та присвоїти їй значення <code>'home'</code>, якщо глобальна змінна не має значення.</li>
    <li>Створити змінну <code>$userName (string)</code> та отримати значення з глобальної змінної з <code>POST</code> запиту. Присвоїти значення <code>'Guest'</code>, якщо глобальна змінна не має значення.</li>
    <li>Створити змінну <code>$userAge (int)</code> та отримати значення з глобальної змінної з <code>POST</code> запиту. Присвоїти значення <code>18</code>, якщо глобальна змінна не має значення.</li>
    <li>Виконати перевірку змінної <code>$userAge</code> чи являється вона числом (тип даних <code>int</code>). Якщо не являється, то присвоїти значення <code>18</code>.</li>
    <li>Створити змінну <code>$message (string)</code>, та отримати значення з глобальної змінної з <code>POST</code> запиту. Присвоїти значення <code>null</code>, якщо глобальна змінна не має значення.</li>
    <li>Присвоєння дефолтних значень змінним <code>$page</code>, <code>$userName</code>, <code>$userAge</code>, <code>$message</code> виконати за допомогою тернарного оператора зливання <code>??</code>.</li>
    <li>Вивести на екран отримані змінні у вказаному місці в кінці сторінки.</li>
    <li>
        <ul>
            <li>За допомогою функцій роботи з рядками вивести на екран:</li>
            <li>довжину повідомлення</li>
            <li>кількість слів у повідомленні</li>
            <li>перші 10 символів повідомлення</li>
            <li>останні 10 символів повідомлення</li>
            <li>повідомлення в верхньому регістрі</li>
            <li>повідомлення в нижньому регістрі</li>
        </ul>
</ol>